package Avto;

public class Main {
    public static void main(String[] args) {
        Car lada = new Car("", "Granta", 2015, "Росcии", "", 1.7, "АКПП", "Универсал", "а158ап777", 5, "Зимние", 0, "Можно заправлять бензином, дизелем на заправке или заряжать на специальных электропарковках, если это электрокар.");
        Car audi = new Car("Audi", "A8 50L TDI", 2020, "Германии", "черный", 3.0, "МКПП", "", "а158ап777", 4, "Летние", 0, "Можно заправлять бензином, дизелем на заправке или заряжать на специальных электропарковках, если это электрокар.");
        Car bmw = new Car("BMW", "Z8", 2021, "", "черный", 3.0, "", "Кабриолет", "а158ап777", 2, "Зимние", 0, "Можно заправлять бензином, дизелем на заправке или заряжать на специальных электропарковках, если это электрокар.");
        Car kia = new Car("Kia", "Sportage", 2018, "Южной Корее", "красный", 2.4, "АКПП", "", "", 5, "", 0, "Можно заправлять бензином, дизелем на заправке или заряжать на специальных электропарковках, если это электрокар.");
        Car hyundai = new Car("Hyundai", "Avante", 0, "Южной Корее", "оранжевый", -1, "АКПП", "Универсал", "а158ап777", 7, "Зимние", 0, "Можно заправлять бензином, дизелем на заправке или заряжать на специальных электропарковках, если это электрокар.");
        Train Martin = new Train("Ласточка", "В-901", 2011, "Россия", "", 301, 3500, 0, "Белорусский вокзал", "Минск-пассажирский", 11, "Нужно заправлять дизелем.");
        Train Lenin = new Train("Ленинград", "D-125", 2019, "Россия", "", 270, 1700, 0, "Ленинградский вокзал", "Ленинград-Пассажирский", 8, "Нужно заправлять дизелем.");
        Bus VW = new Bus("VW", "LT", 2002, "Germany", "Белый", 180, "Можно заправлять бензином или дизелем на заправке.");
        Bus Crafter = new Bus("VW", "Crafter", 2015, "Germany", "Серый", 195, "Можно заправлять бензином или дизелем на заправке.");
        Bus MB = new Bus("MB", "Vito", 2005, "Germany", "Желтый", 205, "Можно заправлять бензином или дизелем на заправке.");
        System.out.println(audi);
        System.out.println(Martin);
        System.out.println(VW);
        System.out.println(Crafter);
        System.out.println(MB);
        Martin.refil();
        lada.refil();
        MB.refil();
    }
}